# Спросить у пользователя имя и возраст последовательно.
# Сохранить результаты в переменные.
# Вывести строку: «Привет, <имя>! Тебе <возраст> лет». 

name = input("Добрый день, позвольте узнать ваше имя? - ")
age = input("Если вы скажете, мне ваше имя мы будем уже почти друзьями! ")

print(f"Привет, {name}! Тебе {age} лет")